app/views/home/index.html.erb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."user_id" = 2 AND "authorizations"."id" = $1 LIMIT 1  [["id", 2]]
---
<p><h6><% if current_user %>
	<% current_user.authorizations.each do |a|%>