app/controllers/authorizations_controller.rb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."uid" = 17235218 AND "authorizations"."provider" = 'vkontakte' LIMIT 1
INSERT INTO "authorizations" ("created_at", "name", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 16 Apr 2012 09:24:50 UTC +00:00], ["name", "Олег Шаппо"], ["provider", "vkontakte"], ["uid", 17235218], ["updated_at", Mon, 16 Apr 2012 09:24:50 UTC +00:00], ["user_id", 1]]
---
  def vkontakte
  	auth = request.env["omniauth.auth"]
    authorization = Authorization.find_by_uid_and_provider(auth["uid"].to_s, auth["provider"])
  	if current_user
      current_user.authorizations.create!(:uid => auth["uid"],:provider => auth["provider"], :name => auth["info"]["name"])