app/controllers/registrations_controller.rb

  def create
  	super
  	session[:omniauth]=nil unless @user.new_record?
  	session[:auth_id] = @user.authorizations.first.id unless @user.authorizations.empty?
---
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."user_id" = 2 LIMIT 1
SELECT COUNT(*) FROM "authorizations" WHERE "authorizations"."user_id" = 2